added arcitect.  diagram✅✅
